app/controllers/logos_controller.rb

  def index
    @logos = Logo.all
---
SELECT "logos".* FROM "logos" ORDER BY random() LIMIT 1

  def show
    @logo = Logo.find(params[:id])
---
SELECT "logos".* FROM "logos" WHERE "logos"."id" = 1 LIMIT 1

  def edit
    @logo = Logo.find(params[:id])
---
SELECT "logos".* FROM "logos" WHERE "logos"."id" = 3 LIMIT 1

  def create
    @logo = Logo.new(params[:logo])

    respond_to do |format|
      if @logo.save
---
INSERT INTO "logos" ("urlsmall", "urllarge", "correct", "choice1", "choice2", "choice3", "created_at", "updated_at") VALUES ('adidas.gif', 'adidas.gif', 'Adidas', 'Fila', 'Nike', 'Reebok', '2011-09-26 00:24:08.688296', '2011-09-26 00:24:08.688296')