app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def topscores
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def show
    @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = 1 LIMIT 1

  def create
    @score = Score.new(params[:score])

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("name", "score", "created_at", "updated_at", "mdd") VALUES ('Brendan', 69326, '2011-10-06 01:58:04.973543', '2011-10-06 01:58:04.973543', NULL)